---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeSettings
source: html/2de0109b-0d0d-a0fe-2adf-6edec8bc1a06.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings

The pipe setting class.

## Syntax (C#)
```csharp
public class PipeSettings : Element
```